Repository: mmxyzptlk/via-livre
Catalog: lib/l10n/app_*.arb
Languages: pt

# mapScreen
source: Map
pt: Mapa

# createReport
source: Report Problem
pt: Reportar Problema

# reportForm
source: Report Road Issue
pt: Relatar Problema na Estrada

source: Issue Type
pt: Tipo de Problema

# description
source: Description (Optional)
pt: Descrição (Opcional)

source: Submit
pt: Enviar

source: Cancel
pt: Cancelar

source: Accident
pt: Acidente

source: Construction
pt: Obra

source: Flood
pt: Enchente

# treeFallen
source: Fallen Tree
pt: Árvore Caída

source: Protest
pt: Protesto

source: Other
pt: Outro

source: Still Present
pt: Ainda Presente

source: No Longer Present
pt: Não Mais Presente

# gettingLocation
source: Getting your location...
pt: Obtendo sua localização...

# locationError
source: Failed to get location. Please enable location services.
pt: Falha ao obter localização. Por favor, habilite os serviços de localização.

# reportCreated
source: Report created successfully
pt: Relatório criado com sucesso

# reportError
source: Failed to create report. Please try again.
pt: Falha ao criar relatório. Por favor, tente novamente.

source: Loading...
pt: Carregando...

# selectIssueType
source: Please select an issue type
pt: Por favor, selecione um tipo de problema

source: Language
pt: Idioma

source: English
pt: Inglês

source: Portuguese
pt: Português

# confirmations
source: {count, plural, =0{No confirmations} =1{1 confirmation} other{{count} confirmations}}
pt: {count, plural, =0{Nenhuma confirmação} =1{1 confirmação} other{{count} confirmações}}

# dismissals
source: {count, plural, =0{No dismissals} =1{1 dismissal} other{{count} dismissals}}
pt: {count, plural, =0{Nenhuma dispensa} =1{1 dispensa} other{{count} dispensas}}

source: Location
pt: Localização

source: Retry
pt: Tentar Novamente

source: Additional details (optional)
pt: Detalhes adicionais (opcional)

source: Failed to load reports
pt: Falha ao carregar relatórios

# failedToVote
source: Failed to vote. Please try again.
pt: Falha ao votar. Por favor, tente novamente.

source: Error
pt: Erro

# reportedAgo
source: {time} ago
pt: há {time}

source: Just now
pt: Agora mesmo

# minutes
source: {count, plural, =1{1 minute} other{{count} minutes}}
pt: {count, plural, =1{1 minuto} other{{count} minutos}}

# hours
source: {count, plural, =1{1 hour} other{{count} hours}}
pt: {count, plural, =1{1 hora} other{{count} horas}}

# days
source: {count, plural, =1{1 day} other{{count} days}}
pt: {count, plural, =1{1 dia} other{{count} dias}}

source: Update Location
pt: Atualizar Localização

source: Location captured
pt: Localização capturada

source: About
pt: Sobre

# appTagline
source: Real-time road condition reports
pt: Relatórios de condições das estradas em tempo real

# aboutTitle
source: About VIA LIVRE
pt: Sobre o VIA LIVRE

# aboutDescription
source: VIA LIVRE is a community-driven platform that helps drivers stay informed about road conditions in real-time. Report and view road issues such as accidents, construction, floods, and more to help fellow drivers navigate safely.
pt: VIA LIVRE é uma plataforma colaborativa que ajuda motoristas a se manterem informados sobre condições das estradas em tempo real. Relate e visualize problemas nas estradas como acidentes, obras, enchentes e mais para ajudar outros motoristas a navegarem com segurança.

# howItWorksTitle
source: How It Works
pt: Como Funciona

# howItWorksDescription
source: 1. View real-time reports on the map 2. Report road issues you encounter 3. Confirm or dismiss reports to help keep information accurate
pt: 1. Visualize relatórios em tempo real no mapa 2. Relate problemas nas estradas que você encontrar 3. Confirme ou descarte relatórios para ajudar a manter as informações precisas

# featuresTitle
source: Features
pt: Recursos

# featureRealTimeMap
source: Real-Time Map
pt: Mapa em Tempo Real

# featureRealTimeMapDesc
source: See road reports updated in real-time on an interactive map
pt: Veja relatórios de estradas atualizados em tempo real em um mapa interativo

# featureReportIssues
source: Report Issues
pt: Relatar Problemas

# featureReportIssuesDesc
source: Quickly report accidents, construction, floods, and other road issues
pt: Relate rapidamente acidentes, obras, enchentes e outros problemas nas estradas

# featureCommunityVerified
source: Community Verified
pt: Verificado pela Comunidade

# featureCommunityVerifiedDesc
source: Reports are verified by the community through confirmations and dismissals
pt: Relatórios são verificados pela comunidade através de confirmações e dispensas

# featureTimeLimited
source: Time-Limited Reports
pt: Relatórios com Tempo Limitado

# featureTimeLimitedDesc
source: All reports expire after 2 hours to ensure only current information is shown
pt: Todos os relatórios expiram após 2 horas para garantir que apenas informações atuais sejam mostradas

source: Important Notice
pt: Aviso Importante

# reportExpiryTitle
source: Report Expiry
pt: Expiração de Relatórios

# reportExpiryDescription
source: All reports automatically expire 2 hours after creation to ensure you only see current and relevant information.
pt: Todos os relatórios expiram automaticamente 2 horas após a criação para garantir que você veja apenas informações atuais e relevantes.

# appVersion
source: Version 1.0.0
pt: Versão 1.0.0

# madeWithLove
source: Made with ❤️ for safer roads
pt: Feito com ❤️ para estradas mais seguras

source: Filter Reports
pt: Filtrar Relatórios

# noDetailsAvailable
source: No additional details available for this report.
pt: Nenhum detalhe adicional disponível para este relatório.

# selectLocationOnMap
source: Tap on the map to select the report location (max {maxDistance} km from your current location)
pt: Toque no mapa para selecionar a localização do relatório (máximo {maxDistance} km da sua localização atual)

# pleaseSelectLocation
source: Please tap on the map to select the report location
pt: Por favor, toque no mapa para selecionar a localização do relatório

# locationTooFar
source: Selected location must be within {maxDistance} km of your current location
pt: A localização selecionada deve estar dentro de {maxDistance} km da sua localização atual

# locationDistanceWarning
source: Location is {distance} km away. Please select a location within {maxDistance} km.
pt: A localização está a {distance} km de distância. Por favor, selecione uma localização dentro de {maxDistance} km.

source: Distance
pt: Distância
